[
  {
    "id": "jeremy-wrathall",
    "name": "Jeremy Wrathall",
    "role": "Founder & Executive Chairman",
    "company": "Cornish Lithium PLC",
    "date": "2025-07-10",
    "relationship": "client",
    "image": null,
    "category": ["wellbeing", "organizational-support", "c-suite"],
    "featured": true,
    "content": "Having worked with you for a few years now and seen the benefits of your work with members of our team I would like to write you a quick letter of commendation. Cornish Lithium values the work that you do with supporting our staff in difficult times. Having experienced traumatic moments in my own life when I didn't know who to turn to, I am glad that members of my team have the opportunity to talk to you when such circumstances arise in their lives. I have always found you a thoughtful and compassionate person and therefore the ideal counsellor in troubled times. I would strongly commend you to others for the service you offer.",
    "excerpt": "Having worked with you for a few years now and seen the benefits of your work with members of our team... I have always found you a thoughtful and compassionate person and therefore the ideal counsellor in troubled times.",
    "linkedin": "https://www.linkedin.com/in/jeremywrathall"
  },
  {
    "id": "steve-hill",
    "name": "Steve Hill",
    "role": "Mentor, Coach, Business Advisor and NED",
    "company": null,
    "date": "2025-09-29",
    "relationship": "manager",
    "image": null,
    "category": ["iod-leadership", "board-advisory"],
    "featured": true,
    "content": "As an Ambassador for the IOD, Craig has started and sustained a local IoD member networking group. This group has been meeting monthly for almost two years now. An excellent achievement. He has also built strong engagements with local authorities and other local groups, representing the views of his local colleagues at them.",
    "excerpt": "Craig has started and sustained a local IoD member networking group meeting monthly for almost two years now. An excellent achievement.",
    "linkedin": "https://www.linkedin.com/in/stevehillned"
  },
  {
    "id": "richard-sharpe",
    "name": "Richard Sharpe",
    "role": "C-Suite Operational Board Leader",
    "company": null,
    "date": "2025-02-11",
    "relationship": "colleague",
    "image": null,
    "category": ["wellbeing", "iod-leadership", "board-advisory"],
    "featured": true,
    "content": "I've had the privilege of working with Craig through the IOD and projects, and what truly sets him apart is his extensive knowledge, continued deep empathy and openness to speak from personal experience. His expertise in mental health support is unrivalled, and I recommend his insight and services to anyone in need. In a fragmented field where experience, skills and qualifications vary, Craig stands out as a highly skilled and dedicated Wellbeing practitioner. Whenever we collaborate, I'm struck by his innate ability to disseminate complex and sensitive situations with care, and insight, always with a practical results-driven approach. His integrity makes him an invaluable asset to any individual or organization he supports. As an established Ambassador for the IoD, Craig has exemplified leadership by bringing Directors together, focusing on the issues that impact them and how they can deal with them. His contributions are both impact-full and inspiring.",
    "excerpt": "His expertise in mental health support is unrivalled... Craig stands out as a highly skilled and dedicated Wellbeing practitioner... As an established Ambassador for the IoD, Craig has exemplified leadership by bringing Directors together.",
    "linkedin": "https://www.linkedin.com/in/richardsharpe"
  },
  {
    "id": "chris-saxby",
    "name": "Chris Saxby",
    "role": "Executive & Non-Executive Leader",
    "company": null,
    "date": "2025-02-04",
    "relationship": "colleague",
    "image": null,
    "category": ["iod-leadership", "wellbeing"],
    "featured": true,
    "content": "Craig has led the IoD's activity in Cornwall as a most effective ambassador. He promotes the ideals and values of the Institute and has been incredibly energetic and successful in deriving closer engagement of directors across the SW peninsula. His direct encouragement of learning has supported many of us, me among them. Added to this, Craig's professional focus on wellbeing leadership has also been evident to those attending - not with a salesman's pitch, but through his natural affinity for the subject within his daily approach to all his activities. Craig is someone who leaders find engaging, knowledgeable, and easy to deal with. I can strongly recommend working with him.",
    "excerpt": "Craig has led the IoD's activity in Cornwall as a most effective ambassador... His professional focus on wellbeing leadership has been evident through his natural affinity for the subject.",
    "linkedin": "https://www.linkedin.com/in/chrissaxby"
  },
  {
    "id": "des-bell",
    "name": "Des Bell",
    "role": "Managing Director",
    "company": "Furniss of Cornwall Ltd",
    "date": "2024-12-04",
    "relationship": "colleague",
    "image": null,
    "category": ["iod-leadership", "board-advisory"],
    "featured": true,
    "content": "Others have rightly recommended Craig as a great Wellbeing practitioner. I would like to recommend Craig's Leadership, Organisational and Interpersonal skills as the Cornwall IOD Ambassador. Craig has grown the membership, galvanised diverse opinions, and provided Leadership on business issues: Highly recommended for these qualities.",
    "excerpt": "Craig's Leadership, Organisational and Interpersonal skills as the Cornwall IOD Ambassador... Craig has grown the membership, galvanised diverse opinions, and provided Leadership on business issues.",
    "linkedin": "https://www.linkedin.com/in/desbell"
  },
  {
    "id": "andrew-honey",
    "name": "Andrew Honey CDir FIoD",
    "role": "NED / Consultant",
    "company": null,
    "date": "2024-12-03",
    "relationship": "colleague",
    "image": null,
    "category": ["wellbeing", "iod-leadership", "board-advisory"],
    "featured": true,
    "content": "Craig is an absolute workhorse, with a mission to change lives through better governance and a real understanding of what wellbeing means. Much more than an 'Employee Assistance Programme' which is a passive device relying on the individual to engage, Craig helps Directors improve overall business performance by making people matter. As an Ambassador for the IoD, he has set a great example, by bring Directors back round the table and focussing on the issues that matter to them.",
    "excerpt": "Craig helps Directors improve overall business performance by making people matter... Much more than an 'Employee Assistance Programme' which is a passive device.",
    "linkedin": "https://www.linkedin.com/in/andrewhoney"
  },
  {
    "id": "phil-tottman",
    "name": "Phil Tottman",
    "role": "Co-Founder | Operations | Communications | Development",
    "company": "Book of Beasties",
    "date": "2023-06-06",
    "relationship": "client",
    "image": null,
    "category": ["executive-coaching", "advisory"],
    "featured": true,
    "content": "Craig has had such a profound and positive impact on Book of Beasties, its vision, continued growth and ongoing success. It has been a true pleasure to work with him, learn from him and collaborate on some amazing partnerships and projects. He came into the company with a level on understanding, empathy and guidance that has been unmatched, reinvigorating the mission and the team through his support. He was never one to turn down a challenge, and was always happy to step in to help when we felt out of our depth or overwhelmed and having him part of our journey has made a brilliant experience of starting a business even more so. Beyond his CEO and Chief Advisory positions with Book of Beasties, Craig has become a dear friend and someone that I know can be trusted whole heartedly, something that is a rare quality. It is safe to say that he is an asset to any position he holds, team he joins or project he supports.",
    "excerpt": "Craig has had such a profound and positive impact on Book of Beasties, its vision, continued growth and ongoing success... He came into the company with a level on understanding, empathy and guidance that has been unmatched.",
    "linkedin": "https://www.linkedin.com/in/philtottman"
  },
  {
    "id": "terry-mullins",
    "name": "Terry Mullins",
    "role": "Founder",
    "company": "The Reluctant Salesman Ltd",
    "date": "2022-06-10",
    "relationship": "client",
    "image": null,
    "category": ["wellbeing", "coaching"],
    "featured": true,
    "content": "It would be hard to imagine a better qualified Wellbeing practitioner than Craig Fearn, in an area that is attracting people who have little experience or real qualifications Craig stands out as a true professional. We've worked together on a number of occasions and I've always been impressed by his ability to bring his caring and insightful skills to complex and delicate situations and achieve outstanding results in a straight forward manner. I can say without hesitation that Craig's talents and innate integrity would be of real benefit to any business or individual he works with.",
    "excerpt": "Craig stands out as a true professional... I've always been impressed by his ability to bring his caring and insightful skills to complex and delicate situations and achieve outstanding results.",
    "linkedin": "https://www.linkedin.com/in/terrymullins"
  },
  {
    "id": "dianne-knight",
    "name": "Dianne Georgina Knight CertPFS",
    "role": "Area Manager SME Business Banking West Country",
    "company": "HSBC UK",
    "date": "2021-09-07",
    "relationship": "client",
    "image": null,
    "category": ["coaching", "executive-coaching"],
    "featured": true,
    "content": "Craig is the ultimate professional. From start to finish, it is so clear that his aim is how he can help. I would say that over my 5 week course, I had challenges (achievable) yet he stretched me to think further than I would do naturally. Personally, Craig has taught me so much about how I think and how I value what I think. I cannot recommend Craig enough, the most sincere and truly dedicated professional with a passion for developing people mentally. It was a rollercoaster...in a good way, and I cannot thank you enough for making me see more clearly about so many things. Mostly about my self doubt which has held me back for so long.... I am pretty much where I need to be and have the tools to help me get there, thank you so much Craig... your efforts and knowledge are guiding me well and I am excited for my future at work now.",
    "excerpt": "Craig has taught me so much about how I think and how I value what I think... He stretched me to think further than I would do naturally. I am excited for my future at work now.",
    "linkedin": "https://www.linkedin.com/in/dianneknight"
  },
  {
    "id": "michael-redgewell",
    "name": "Michael Redgewell",
    "role": "Regional Development Manager",
    "company": "Edrington UK",
    "date": "2021-08-23",
    "relationship": "client",
    "image": null,
    "category": ["wellbeing", "organizational-support"],
    "featured": true,
    "content": "I've worked with Craig as part of my role with Edrington UK to develop an online platform for hospitality professionals to receive the support they need during these difficult times. Craig has, at all times, been a fantastic support and helped us drive forward the project making it the best possible setup for the people it's designed to help. It is now an absolute pleasure to read the wonderful feedback he and the project receives.",
    "excerpt": "Craig has been a fantastic support and helped us drive forward the project making it the best possible setup for the people it's designed to help.",
    "linkedin": "https://www.linkedin.com/in/michaelredgewell"
  },
  {
    "id": "yana-james-mills",
    "name": "Yana James-Mills",
    "role": "Dental Hygiene Therapist",
    "company": null,
    "date": "2021-07-07",
    "relationship": "client",
    "image": null,
    "category": ["wellbeing", "coaching"],
    "featured": false,
    "content": "I cannot recommend Craig enough. He was a fundamental part of my journey through University. He was there with advice, clarity and resources to help with stress and anxiety through a difficult course. I came up against a very difficult situation with the university and Craig not only held my hand through it all, with managing my anxiety but also when it came to fighting my corner. He built my confidence over the 3 years of mentoring in all aspects of my life and gave me the tools I needed to overcome life situations. He encouraged me and was there at the end of the phone for mentoring and wellbeing advice, he goes above and beyond for his clients. If it wasn't for Craig, I'm not sure I would have gotten through my degree and achieved the results I did. He's a wealth of knowledge and is always onto the next project, helping whoever he can along the way! An incredible Man and mentor!",
    "excerpt": "He built my confidence over the 3 years of mentoring in all aspects of my life and gave me the tools I needed to overcome life situations. He goes above and beyond for his clients.",
    "linkedin": "https://www.linkedin.com/in/yanajamesmills"
  },
  {
    "id": "george-williams",
    "name": "George Williams",
    "role": "Student",
    "company": "Falmouth University",
    "date": "2021-05-26",
    "relationship": "client",
    "image": null,
    "category": ["wellbeing", "coaching"],
    "featured": false,
    "content": "I have known Craig for about 2 years and he has helped me through a lot of Issues I have had. He is very professional and will always go above and beyond for his clients. I would recommend him to anyone looking for mental wellbeing mentor.",
    "excerpt": "He is very professional and will always go above and beyond for his clients.",
    "linkedin": "https://www.linkedin.com/in/georgewilliams"
  },
  {
    "id": "cora-polland",
    "name": "Cora Polland",
    "role": "Green Skills Coordinator",
    "company": null,
    "date": "2021-05-13",
    "relationship": "client",
    "image": null,
    "category": ["wellbeing", "coaching"],
    "featured": false,
    "content": "Craig's guidance and advice has been invaluable in helping me overcome any obstacles at university. He goes above and beyond for his clients, and I am very grateful for the efforts he has invested in seeing me through to the end of my degree and for always believing in my abilities. Craig is incredibly kind, hard-working, empathetic and understanding whilst never being patronising. Confiding in him feels like confiding in a friend and I could not recommend him more highly for anyone seeking mentoring or support.",
    "excerpt": "Craig is incredibly kind, hard-working, empathetic and understanding whilst never being patronising. Confiding in him feels like confiding in a friend.",
    "linkedin": "https://www.linkedin.com/in/corapolland"
  },
  {
    "id": "sabina-on-stothard",
    "name": "Sabina Ôn-Stothard PIEMA",
    "role": "Senior BNG Consultant",
    "company": "AECOM",
    "date": "2020-09-22",
    "relationship": "client",
    "image": null,
    "category": ["wellbeing", "coaching"],
    "featured": false,
    "content": "Craig is one of a kind. He has the professional credentials but also the personal experience needed in his job. He brings such compassion and a sense of humour to his role, which is just what I needed. Great guy :)",
    "excerpt": "He has the professional credentials but also the personal experience needed in his job. He brings such compassion and a sense of humour to his role.",
    "linkedin": "https://www.linkedin.com/in/sabinaonstothard"
  },
  {
    "id": "david-mcguire",
    "name": "David McGuire",
    "role": "B2B Copywriting and Creativity Trainer, Advisor, and Speaker",
    "company": null,
    "date": "2020-06-01",
    "relationship": "client",
    "image": null,
    "category": ["wellbeing", "organizational-support"],
    "featured": true,
    "content": "Different team members deal with stress in different ways, so we wanted to give our people flexible, confidential access to expert psychological support as and when they needed it. Craig has enabled us to do exactly that, and the feedback has been excellent. We're really impressed.",
    "excerpt": "We wanted to give our people flexible, confidential access to expert psychological support as and when they needed it. Craig has enabled us to do exactly that, and the feedback has been excellent.",
    "linkedin": "https://www.linkedin.com/in/davidmcguire"
  },
  {
    "id": "nidal-ramini",
    "name": "Nidal Ramini",
    "role": "Advocacy Director, EU, IMEA, APAC & GTR",
    "company": "Brown-Forman",
    "date": "2020-05-29",
    "relationship": "client",
    "image": null,
    "category": ["wellbeing", "organizational-support"],
    "featured": true,
    "content": "I worked with Craig on a well-being project that we curated with the Healthy Hospo organisation. Craig presented on coping with stress and dealing with anxiety and delivered an informative, engaging and insightful session. I can't recommend Craig highly enough and I for one am looking forward to working with him in the future.",
    "excerpt": "Craig delivered an informative, engaging and insightful session on coping with stress and dealing with anxiety.",
    "linkedin": "https://www.linkedin.com/in/nidalramini"
  },
  {
    "id": "tim-etherington-judge",
    "name": "Tim Etherington-Judge",
    "role": "Founder",
    "company": "Avallen Solutions, Avallen Spirits, Healthy Hospo",
    "date": "2020-05-28",
    "relationship": "client",
    "image": null,
    "category": ["wellbeing", "organizational-support"],
    "featured": true,
    "content": "I've been fortunate enough to have worked with Craig on a couple of projects now and what sets him apart is not his encyclopedic knowledge of his subject matter, it's his empathy and ability to speak from a place of first hand experience. I'm excited to continue working with Craig and recommend his services to everyone that is need of mental health support.",
    "excerpt": "What sets him apart is not his encyclopedic knowledge of his subject matter, it's his empathy and ability to speak from a place of first hand experience.",
    "linkedin": "https://www.linkedin.com/in/timetheringtonjudge"
  },
  {
    "id": "mark-kendall",
    "name": "Mark Kendall",
    "role": "Freelance Web Developer",
    "company": null,
    "date": "2019-08-30",
    "relationship": "client",
    "image": null,
    "category": ["wellbeing", "coaching"],
    "featured": false,
    "content": "Psychiatrists, psychologists, councillors, mentors are all names that we associate with helping us through the mental difficulties that we all go through sometimes but I Craig goes past that and simply provide what we need by listening and providing simple advice and observations that 9 times out of ten we already know but are afraid to admit to ourselves. This for me is the core of getting help and what Craig excels at. My thanks to him not only for the clarity but for being a warm and genuine human being who wants to help.",
    "excerpt": "Craig provides what we need by listening and providing simple advice and observations... a warm and genuine human being who wants to help.",
    "linkedin": "https://www.linkedin.com/in/markkendall"
  },
  {
    "id": "mark-ripley",
    "name": "Mark Ripley",
    "role": "Award Winning CTO",
    "company": null,
    "date": "2019-08-28",
    "relationship": "colleague",
    "image": null,
    "category": ["wellbeing", "coaching"],
    "featured": false,
    "content": "Craig is the dog's danglies when it comes to mental health, mentoring and finding new approaches to solving issues with anxiety, depression and chronic pain.",
    "excerpt": "Craig is excellent when it comes to mental health, mentoring and finding new approaches to solving issues with anxiety, depression and chronic pain.",
    "linkedin": "https://www.linkedin.com/in/markripley"
  },
  {
    "id": "becky-mason",
    "name": "Becky Mason",
    "role": "Graduate in BA Marine & Natural History Photography",
    "company": null,
    "date": "2019-06-26",
    "relationship": "client",
    "image": null,
    "category": ["wellbeing", "coaching"],
    "featured": false,
    "content": "I have been seeing Craig for a while now, he has got me through a lot of stress. I would highly recommend him and he always makes you feel comfortable whenever you see him.",
    "excerpt": "He has got me through a lot of stress. I would highly recommend him and he always makes you feel comfortable.",
    "linkedin": "https://www.linkedin.com/in/beckymason"
  },
  {
    "id": "luke-dalby",
    "name": "Luke Dalby",
    "role": "Teacher of Geography",
    "company": "SFG",
    "date": "2019-06-26",
    "relationship": "client",
    "image": null,
    "category": ["wellbeing", "coaching"],
    "featured": false,
    "content": "Craig Fearn provides an excellent mentoring service through his company Lighthouse Mentoring. Craig goes to great lengths to ensure that the personal needs and welfare of his clients are met and taken care of. In addition, Craig truly wants the best for his clients and will do anything to ensure that his client's personal wellbeing is looked after. Overall, I have and will continue to recommend anyone facing challenges to their personal development and mental wellbeng to seek help from Craig Fearn and his company, Lighthouse Mentoring.",
    "excerpt": "Craig goes to great lengths to ensure that the personal needs and welfare of his clients are met and taken care of. Craig truly wants the best for his clients.",
    "linkedin": "https://www.linkedin.com/in/lukedalby"
  },
  {
    "id": "madison-watling",
    "name": "Madison Watling",
    "role": "Learning Disabilities Team Leader Manager",
    "company": null,
    "date": "2019-06-26",
    "relationship": "client",
    "image": null,
    "category": ["wellbeing", "coaching"],
    "featured": false,
    "content": "Craig helped me through my last 2 years at University, he kept me going during a very tough time for myself. When I thought I had to drop out due to being very ill. He kept me going and helped me keep to my deadlines, letting me express all of the feelings I was having and seeing the finish line of graduating which was very hard for me to see. He has helped me be the women I am today in a healthy relationship for once and someone who actually realises how strong they are and not to give up even if times are hard. He was like my best friend someone I could lean on when I didn't know who to talk to. I am so grateful for Craig and wish I could keep seeing him (I live too far away now). Craig made me be a better person, someone who goes with the flow a little better, someone who thinks before she talks and someone who looks at life at the now and not the past or the future. He helped me focus on the now and enjoy the now and I couldn't be more happy than I am since his help! I couldn't recommend him enough! Thank you Craig x",
    "excerpt": "Craig helped me through my last 2 years at University during a very tough time... He helped me focus on the now and enjoy the now and I couldn't be more happy.",
    "linkedin": "https://www.linkedin.com/in/madisonwatling"
  }
]
